#+TITLE: Functions
#+AUTHOR: Peter Moresi

The long-term goal is to build npm packages for
all 300 or so functions supported commonly by spreadsheet
software. The purpose is to make an infrastructure of UMD
code that can be added to any modern browser and node.js.
This infrastruture will consist of small packages that each
contain one pure function or one group of pure functions.

The functions in this library do not have side effects. They
accept input and they return output. This is what makes them
pure. This makes the functions easy to compose because they
can nested inside indefinitely. This is not new. This is how
spreadsheets work today.

This project seeks to make it easy to selectively and automatically
load the dependencies needed to fulfill the user's requirements to complete
the calculations.

While, I plan to provide a workbook model that will run today's 
spreadsheets. I don't want your imagination to stop there. These
functions will happily operate on JS objects of any kind. You can
use the logical functions to clean up JSX.

#+BEGIN_SRC js
var IF = require('formula-if');
let el = <div className={ IF( this.state.shouldBeTrue, "YES-CSS", "NO" ) } />
#+END_SRC

The TEXT function can format numbers with spreadsheet format codes.

#+BEGIN_SRC js
var textFormatter = require('formula-text'); // call it what you like
textFormatter( 100, "$#,###.##" ) // => $100.00
#+END_SRC

There are a lot of useful functions today and many more will be added in the future.

* Status 

  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  |   | Category             | Completed | Total | % Coded | Github | NPM | CircleCI |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  | # | Logical              |         9 |     9 |  100.0% |      9 |   9 |        1 |
  | # | Date and Time        |        17 |    23 |   74.0% |      0 |   0 |        0 |
  | # | Engineering          |         2 |    51 |    4.0% |      0 |   0 |        0 |
  | # | Financial            |         8 |    31 |   26.0% |      0 |   0 |        0 |
  | # | Information          |        22 |    23 |   96.0% |     11 |  11 |        0 |
  | # | Lookup and Reference |        12 |    12 |  100.0% |      3 |   3 |        0 |
  | # | Math                 |        44 |    69 |   64.0% |     11 |  11 |        0 |
  | # | Stats                |         5 |    54 |   10.0% |      0 |   0 |        0 |
  | # | Text                 |        24 |    29 |   83.0% |      0 |   0 |        0 |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  | # | Total                |       115 |   218 |   53.0% |        |     |          |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  #+TBLFM: @3$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@4$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@5$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@6$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@2$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@7$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@8$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@9$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@10$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@11$3=vsum(@5..10)::@11$4=vsum(@5..10)::@11$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")

